for-8676/performance_test/FIO/psync/tbox/core4.log
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=16.1MiB/s][r=4121 IOPS][eta 00m:00s]
rand_read: (groupid=0, jobs=1): err= 0: pid=7649: Mon Apr 21 08:36:00 2025
  read: IOPS=4028, BW=15.7MiB/s (16.5MB/s)(787MiB/50001msec)
    clat (usec): min=148, max=17315, avg=246.19, stdev=266.54
     lat (usec): min=149, max=17315, avg=246.40, stdev=266.58
    clat percentiles (usec):
     |  1.00th=[  161],  5.00th=[  172], 10.00th=[  178], 20.00th=[  188],
     | 30.00th=[  194], 40.00th=[  200], 50.00th=[  206], 60.00th=[  215],
     | 70.00th=[  235], 80.00th=[  265], 90.00th=[  281], 95.00th=[  314],
     | 99.00th=[ 1074], 99.50th=[ 1467], 99.90th=[ 3621], 99.95th=[ 4948],
     | 99.99th=[10421]
   bw (  KiB/s): min=12182, max=17579, per=100.00%, avg=16141.55, stdev=1069.56, samples=99
   iops        : min= 3045, max= 4394, avg=4034.99, stdev=267.41, samples=99
  lat (usec)   : 250=74.51%, 500=23.01%, 750=0.62%, 1000=0.63%
  lat (msec)   : 2=0.95%, 4=0.20%, 10=0.07%, 20=0.01%
  cpu          : usr=1.16%, sys=27.37%, ctx=201421, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=201447,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=15.7MiB/s (16.5MB/s), 15.7MiB/s-15.7MiB/s (16.5MB/s-16.5MB/s), io=787MiB (825MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=200784/25, merge=0/10, ticks=45780/16, in_queue=45804, util=93.20%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1): [w(1)][100.0%][w=30.3MiB/s][w=7750 IOPS][eta 00m:00s]
rand_wr: (groupid=0, jobs=1): err= 0: pid=7736: Mon Apr 21 08:36:51 2025
  write: IOPS=7353, BW=28.7MiB/s (30.1MB/s)(1436MiB/50001msec); 0 zone resets
    clat (usec): min=70, max=12308, avg=134.14, stdev=201.44
     lat (usec): min=70, max=12308, avg=134.34, stdev=201.45
    clat percentiles (usec):
     |  1.00th=[   84],  5.00th=[   89], 10.00th=[   93], 20.00th=[   99],
     | 30.00th=[  104], 40.00th=[  109], 50.00th=[  114], 60.00th=[  118],
     | 70.00th=[  124], 80.00th=[  131], 90.00th=[  147], 95.00th=[  176],
     | 99.00th=[  758], 99.50th=[ 1106], 99.90th=[ 2704], 99.95th=[ 4080],
     | 99.99th=[ 7898]
   bw (  KiB/s): min=18966, max=32373, per=100.00%, avg=29432.21, stdev=2452.06, samples=99
   iops        : min= 4741, max= 8093, avg=7357.68, stdev=613.00, samples=99
  lat (usec)   : 100=22.52%, 250=75.32%, 500=0.87%, 750=0.27%, 1000=0.37%
  lat (msec)   : 2=0.46%, 4=0.12%, 10=0.05%, 20=0.01%
  cpu          : usr=1.86%, sys=71.15%, ctx=338489, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,367666,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=28.7MiB/s (30.1MB/s), 28.7MiB/s-28.7MiB/s (30.1MB/s-30.1MB/s), io=1436MiB (1506MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=5/365978, merge=0/20, ticks=4/43926, in_queue=43961, util=89.45%
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=15.1MiB/s][r=3869 IOPS][eta 00m:00s]
rand_read: (groupid=0, jobs=1): err= 0: pid=7848: Mon Apr 21 08:37:41 2025
  read: IOPS=3690, BW=14.4MiB/s (15.1MB/s)(721MiB/50001msec)
    clat (usec): min=150, max=15099, avg=268.95, stdev=260.07
     lat (usec): min=150, max=15099, avg=269.16, stdev=260.09
    clat percentiles (usec):
     |  1.00th=[  169],  5.00th=[  184], 10.00th=[  192], 20.00th=[  204],
     | 30.00th=[  215], 40.00th=[  223], 50.00th=[  231], 60.00th=[  241],
     | 70.00th=[  258], 80.00th=[  281], 90.00th=[  310], 95.00th=[  347],
     | 99.00th=[ 1139], 99.50th=[ 1582], 99.90th=[ 3752], 99.95th=[ 5014],
     | 99.99th=[ 8586]
   bw (  KiB/s): min=10896, max=16524, per=100.00%, avg=14773.26, stdev=1023.59, samples=99
   iops        : min= 2724, max= 4131, avg=3692.93, stdev=255.87, samples=99
  lat (usec)   : 250=66.71%, 500=30.40%, 750=0.76%, 1000=0.71%
  lat (msec)   : 2=1.09%, 4=0.23%, 10=0.09%, 20=0.01%
  cpu          : usr=1.02%, sys=25.81%, ctx=184542, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=184543,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=14.4MiB/s (15.1MB/s), 14.4MiB/s-14.4MiB/s (15.1MB/s-15.1MB/s), io=721MiB (756MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=183724/30, merge=0/14, ticks=45865/15, in_queue=45886, util=93.62%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1): [w(1)][100.0%][w=30.1MiB/s][w=7697 IOPS][eta 00m:00s]
rand_wr: (groupid=0, jobs=1): err= 0: pid=7970: Mon Apr 21 08:38:31 2025
  write: IOPS=7459, BW=29.1MiB/s (30.6MB/s)(1457MiB/50001msec); 0 zone resets
    clat (usec): min=69, max=15505, avg=132.26, stdev=196.52
     lat (usec): min=69, max=15505, avg=132.47, stdev=196.61
    clat percentiles (usec):
     |  1.00th=[   83],  5.00th=[   88], 10.00th=[   92], 20.00th=[   98],
     | 30.00th=[  103], 40.00th=[  109], 50.00th=[  113], 60.00th=[  118],
     | 70.00th=[  123], 80.00th=[  130], 90.00th=[  145], 95.00th=[  172],
     | 99.00th=[  709], 99.50th=[ 1074], 99.90th=[ 2638], 99.95th=[ 3949],
     | 99.99th=[ 7767]
   bw (  KiB/s): min=21158, max=32230, per=100.00%, avg=29858.66, stdev=1901.65, samples=99
   iops        : min= 5289, max= 8057, avg=7464.29, stdev=475.39, samples=99
  lat (usec)   : 100=23.84%, 250=74.12%, 500=0.83%, 750=0.24%, 1000=0.37%
  lat (msec)   : 2=0.44%, 4=0.11%, 10=0.04%, 20=0.01%
  cpu          : usr=2.37%, sys=70.67%, ctx=345073, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,372971,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=29.1MiB/s (30.6MB/s), 29.1MiB/s-29.1MiB/s (30.6MB/s-30.6MB/s), io=1457MiB (1528MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=5/371288, merge=0/19, ticks=3/44024, in_queue=44045, util=89.36%
rand_read: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1): [r(1)][100.0%][r=16.1MiB/s][r=4124 IOPS][eta 00m:00s]
rand_read: (groupid=0, jobs=1): err= 0: pid=8045: Mon Apr 21 08:39:21 2025
  read: IOPS=3964, BW=15.5MiB/s (16.2MB/s)(774MiB/50001msec)
    clat (usec): min=148, max=16104, avg=250.31, stdev=244.28
     lat (usec): min=148, max=16104, avg=250.51, stdev=244.30
    clat percentiles (usec):
     |  1.00th=[  163],  5.00th=[  174], 10.00th=[  182], 20.00th=[  190],
     | 30.00th=[  198], 40.00th=[  204], 50.00th=[  212], 60.00th=[  225],
     | 70.00th=[  243], 80.00th=[  265], 90.00th=[  289], 95.00th=[  326],
     | 99.00th=[ 1057], 99.50th=[ 1467], 99.90th=[ 3621], 99.95th=[ 4555],
     | 99.99th=[ 8455]
   bw (  KiB/s): min=11460, max=17200, per=100.00%, avg=15878.28, stdev=1298.50, samples=99
   iops        : min= 2865, max= 4300, avg=3969.26, stdev=324.64, samples=99
  lat (usec)   : 250=72.51%, 500=25.04%, 750=0.67%, 1000=0.65%
  lat (msec)   : 2=0.85%, 4=0.20%, 10=0.07%, 20=0.01%
  cpu          : usr=1.31%, sys=26.83%, ctx=198200, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=198208,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=15.5MiB/s (16.2MB/s), 15.5MiB/s-15.5MiB/s (16.2MB/s-16.2MB/s), io=774MiB (812MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=197396/28, merge=0/12, ticks=45849/17, in_queue=45877, util=93.56%
rand_wr: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=32
fio-3.26
Starting 1 process
Jobs: 1 (f=1): [w(1)][100.0%][w=29.3MiB/s][w=7500 IOPS][eta 00m:00s]
rand_wr: (groupid=0, jobs=1): err= 0: pid=8179: Mon Apr 21 08:40:11 2025
  write: IOPS=7531, BW=29.4MiB/s (30.8MB/s)(1471MiB/50001msec); 0 zone resets
    clat (usec): min=69, max=12464, avg=130.96, stdev=180.15
     lat (usec): min=69, max=12464, avg=131.16, stdev=180.17
    clat percentiles (usec):
     |  1.00th=[   83],  5.00th=[   88], 10.00th=[   92], 20.00th=[   98],
     | 30.00th=[  103], 40.00th=[  109], 50.00th=[  113], 60.00th=[  118],
     | 70.00th=[  123], 80.00th=[  130], 90.00th=[  145], 95.00th=[  172],
     | 99.00th=[  635], 99.50th=[ 1029], 99.90th=[ 2409], 99.95th=[ 3654],
     | 99.99th=[ 7177]
   bw (  KiB/s): min=20589, max=32809, per=100.00%, avg=30148.65, stdev=2073.11, samples=99
   iops        : min= 5147, max= 8202, avg=7536.84, stdev=518.28, samples=99
  lat (usec)   : 100=23.61%, 250=74.46%, 500=0.79%, 750=0.24%, 1000=0.36%
  lat (msec)   : 2=0.40%, 4=0.11%, 10=0.04%, 20=0.01%
  cpu          : usr=2.14%, sys=72.14%, ctx=344866, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,376575,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=29.4MiB/s (30.8MB/s), 29.4MiB/s-29.4MiB/s (30.8MB/s-30.8MB/s), io=1471MiB (1542MB), run=50001-50001msec

Disk stats (read/write):
  vda: ios=4/374886, merge=0/22, ticks=2/44045, in_queue=44072, util=90.13%